---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RouteAnalysis
source: html/45f330c1-2cc4-1790-4963-6c67feeae40d.htm
---
# Autodesk.Revit.DB.GroupTypeId.RouteAnalysis Property

Route Analysis.

## Syntax (C#)
```csharp
public static ForgeTypeId RouteAnalysis { get; }
```